import Vue from 'vue'
import Vuex from 'vuex'
import mutations from './mutations'
import actions from './actions'

Vue.use(Vuex);


const state={
  //TODO 存储页头页尾Loading显示控制相关*************************************************************************//

  isHeaderShow:false,       //存放头部组件header显示控制
  isFooterShow:false,      //存放尾部组件footer显示控制
  isLoading:false,      //存组件loading显示控制
  firstDeposit:{isShow:false,isShowIcon:true}, //存放首存优惠数据
  isShowFirstTip:false,    //开户首存提示窗

  //数据类别分割线-------------------------------------------------------------------------------------------------------//

  //TODO 存储跳转路径相关*********************************************************************************//

  currentPath:'/',   //存放当前路径
  enterPath:'/',     //存放返回上一页路径（一级页面）
  backPath:'/',      //存放返回上一页路径（二级页面）

  //数据类别分割线-------------------------------------------------------------------------------------------------------//

  //TODO 存储用户信息相关*********************************************************************************//

  isLogin:false,           //存放用户登录状态
  level:0,              //存放用户账户等级
  datalevel:0,         //存放用户等级升级经验
  levelName:'LV.0游客',   //存放用户等级名称
  userName:null,           //存放用户名
  score:0,           //存放用户积分
  balance:0,        //存放用户余额
  playerId:null,   //存放用户ID
  bankInfo: {},     // 存放用户银行卡信息
  phoneNumber:null, //存放用户手机号码
  registrationTime: '',  // 存放用户开户日期
  savesend20:null,  // 存放笔笔存送20
  savesend38:null,  // 存放笔笔存送38
  unReadMessageCount:0,  // 存放用户未读信息数量
  weekSaveAmount:0,  // 存放用户周存款金额
  nextUpLevelAmount:[0,0,0,0,0],  // 存放用户升级周存款要求金额
  setRefreshMoney:null,    //刷新余额定时器
  encryptionPhoneNumber: '',  // 用户加密电话号
  promoCodeCount: 0, // 存放未使用优惠代码数量
 


  //数据类别分割线-------------------------------------------------------------------------------------------------------//

  //TODO 存储提示窗口相关*********************************************************************************//

  tipwinShow:false,  //存放提示窗口显示控制
  tipTitle:null,     //存放提示窗口标题
  tipContent:null,   //存放提示内容
  tipButton:null,    //存放按钮集名称和按钮回调函数
  tipCloseTime:null,   //存放自动关闭窗口时间
  tipCloseCallback:null,  //存放设置自动关闭后回调函数
  tipwinType:null,    //存放提示窗口类型名称和数据

  //数据类别分割线-------------------------------------------------------------------------------------------------------//

  //TODO 存储客服窗口相关*********************************************************************************//
  isShowCostomer:false,   //存放首页客服窗口显示控制
  live800:['https://eulivechat.com/chat/chatClient/chatbox.jsp?companyID=265&configID=18&jid='],    //存放在线客服URL
  qqService:['800167818'], //存放QQ客服地址
  //数据类别分割线-------------------------------------------------------------------------------------------------------//

  //TODO 存储平台公告信息相关*****************************************************************************//

  notice:null,     //存放公告信息

  //数据类别分割线-------------------------------------------------------------------------------------------------------//

  //存放活动信息---------------------------------------------------------------------------------------------------------//
  news: 0,

  /* ---------------------------------------- 支付订单信息 start ----------------------------------------- */ 
  alipayOrder: null,     // 支付宝订单信息
  minDepositAmount: 1,   // 平台设置存款最低限额
  /* ---------------------------------------- 支付订单信息 end   ----------------------------------------- */ 
  loginErrorCount: 0,   // 登陆错误次数

  firstduobaoShow:true  //首页弹框控制
};



export default new Vuex.Store({
  state,
  mutations,
  actions
})
